tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "samtay/tui"
# Text-based UI library
brew "ncurses"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Generic library support script
brew "libtool"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Light UNIX download accelerator
brew "axel"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Cross-platform library for audio I/O
brew "portaudio"
# Console-based Audio Visualizer for ALSA
brew "cava"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Dependency manager for Cocoa projects
brew "cocoapods"
# CPU feature identification for Go
brew "cpuid"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Powerful, lightweight programming language
brew "lua"
# Command-driven, interactive function plotting
brew "gnuplot"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# GNU grep, egrep and fgrep
brew "grep"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Full featured CLI system information tool
brew "inxi"
# Rainbows and unicorns in your console!
brew "lolcat"
# Utility for directing compilation
brew "make"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Atlas CLI enables you to manage your MongoDB Atlas
brew "mongodb-atlas-cli"
# Drive some car across the moon
brew "moon-buggy"
# Text-mode videogame inspired by Namco's Pac-Man
brew "myman"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Fast, highly customisable system info script
brew "neofetch"
# Space Invaders in the terminal
brew "ninvaders"
# Classic snake game with textual interface
brew "nsnake"
# Package for scientific computing with Python
brew "numpy"
# Renders an animated, color, ANSI-text loop of the Poptart Cat
brew "nyancat"
# Pacman for console
brew "pacman4console"
# Shell command parallelization utility
brew "parallel"
# Object-relational database system
brew "postgresql@15"
# Persistence Of Vision RAYtracer (POVRAY)
brew "povray"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Space Invaders in your terminal written in Go
brew "spaceinvaders-go"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Download YouTube videos from the command-line
brew "youtube-dl"
# This package contains standard utilities for interacting with MongoDB.
brew "mongodb/brew/mongodb-database-tools"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Tetris in your terminal
brew "samtay/tui/tetris"
# Audio utility
cask "background-music"
# GPU-based terminal emulator
cask "kitty"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
cask "not-pacman"
vscode "13xforever.language-x86-64-assembly"
vscode "74th.monokai-charcoal-high-contrast"
vscode "alefragnani.pascal"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "eamodio.gitlens"
vscode "GitHub.github-vscode-theme"
vscode "jeff-hykin.better-cpp-syntax"
vscode "keyring.Lua"
vscode "mongodb.mongodb-vscode"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.remote-explorer"
vscode "redhat.java"
vscode "roerohan.mongo-snippets-for-node-js"
vscode "sumneko.lua"
vscode "timonwong.shellcheck"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
